import { Component } from '@angular/core';

@Component({
  selector: 'app-hotel-details',
  templateUrl: './hotel-details.component.html',
  styleUrls: ['./hotel-details.component.css']
})
export class HotelDetailsComponent {
  category: string = 'فنادق ومنتجعات سياحية';
  hotelName: string = 'Resissaddsa';
  starRating: string = 'starsssss';
  features: string[] = [
    'قريب من الطريق لادولي',
    'مسبح عائلي',
    'ملعب تنس',
    'صالون تجميل وسبا'
  ];
  description: string = `
    لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء
    كانت تصاميم مطبوعة … بروشور أو فلاير على سبيل المثال … أو نماذج مواقع إنترنت …
    وعند موافقة العميل المبدئية على التصميم يتم إزالة هذا النص من التصميم ويتم وضع النصوص النهائية المطلوبة
    للتصميم ويقول البعض إن وضع النصوص التجريبية بالتصميم قد تشغل المشاهد عن وضع الكثير من الملاحظات أو
    الانتقادات للتصميم الأساسي.
    وخلافًا للاعتقاد السائد فإن لوريم إيبسوم ليس نصًا عشوائيًا، بل إن له جذور في الأدب اللاتيني الكلاسيكي منذ
    العام 45 قبل الميلاد. من كتاب “حول أقاصي الخير والشر”
  `;

}
